brew "mas" if system "defaults read MobileMeAccounts Accounts &>/dev/null"

brew "git"
brew "neovim"
cask "ghostty" unless OS.wsl?
brew "container" if OS.mac?
brew "ripgrep"

brew "lua-language-server"
brew "biome"
brew "yaml-language-server"
brew "bash-language-server"
brew "typescript-language-server"
brew "basedpyright"
brew "gopls"

brew "gh"
brew "opencode"

cask "obsidian" unless OS.wsl?

local_brewfile = File.expand_path("local.Brewfile", __dir__)
instance_eval(File.read(local_brewfile)) if File.exist?(local_brewfile)
